// Вывести на экран четные числа от 1 до N
int a=1;
int N=22;
while (a<=N)
{
if (a%2==0)
{
System.Console.WriteLine($"{a}");

}
a=a+1;
}