// Вывести на экран числа от -N до N
int N=-6;
int Y=6;
while (N<=Y)

{
System.Console.WriteLine($"{N}");
N=N+1;
}

